IRP/src/Documents/GoodsReceipt/GoodsReceipt.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>GoodsReceipt</name>
  <registerRecords>AccumulationRegister.GoodsInTransitIncoming</registerRecords>
  <registerRecords>AccumulationRegister.StockBalance</registerRecords>
  <registerRecords>AccumulationRegister.StockReservation</registerRecords>
  <registerRecords>AccumulationRegister.ReceiptOrders</registerRecords>
  <registerRecords>AccumulationRegister.GoodsReceiptSchedule</registerRecords>
  <registerRecords>AccumulationRegister.GoodsInTransitOutgoing</registerRecords>
  <registerRecords>AccumulationRegister.InventoryBalance</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalName</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ItemList</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Store</name>
      <type>
        <types>CatalogRef.Stores</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>ReceiptBasis</name>
      <type>
        <types>DefinedType.typeReceiptBasis</types>
      </type>
    </attributes>
    <attributes>
      <name>SalesOrder</name>
      <type>
        <types>DocumentRef.SalesOrder</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>SerialLotNumberList</name>
    <attributes>
      <name>SerialLotNumber</name>
      <type>
        <types>CatalogRef.SerialLotNumbers</types>
      </type>
    </attributes>
    <attributes>
      <name>KeyRef</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/AccumulationRegisters/GoodsInTransitIncoming/GoodsInTransitIncoming.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>GoodsInTransitIncoming</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>DefinedType.typeQuantity</types>
    </type>
  </resources>
  <dimensions>
    <name>Store</name>
    <type>
      <types>CatalogRef.Stores</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ReceiptBasis</name>
    <type>
      <types>DefinedType.typeReceiptBasis</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ItemKey</name>
    <type>
      <types>CatalogRef.ItemKeys</types>
    </type>
  </dimensions>
  <dimensions>
    <name>RowKey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

IRP/src/Documents/PurchaseOrder/PurchaseOrder.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>PurchaseOrder</name>
  <registerRecords>AccumulationRegister.OrderBalance</registerRecords>
  <registerRecords>AccumulationRegister.ReceiptOrders</registerRecords>
  <registerRecords>AccumulationRegister.InventoryBalance</registerRecords>
  <registerRecords>AccumulationRegister.GoodsInTransitIncoming</registerRecords>
  <registerRecords>AccumulationRegister.StockBalance</registerRecords>
  <registerRecords>AccumulationRegister.GoodsReceiptSchedule</registerRecords>
  <registerRecords>AccumulationRegister.OrderProcurement</registerRecords>
  <registerRecords>AccumulationRegister.StockReservation</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>CatalogRef.ObjectStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalName</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceIncludeTax</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Agreement</name>
    <type>
      <types>CatalogRef.Agreements</types>
    </type>
  </attributes>
  <attributes>
    <name>GoodsReceiptBeforePurchaseInvoice</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ItemList</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Store</name>
      <type>
        <types>CatalogRef.Stores</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>PurchaseBasis</name>
      <type>
        <types>DefinedType.typePurchaseBasis</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.typePrice</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>TotalAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>NetAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>OffersAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>PriceType</name>
      <type>
        <types>CatalogRef.PriceTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>BusinessUnit</name>
      <type>
        <types>CatalogRef.BusinessUnits</types>
      </type>
    </attributes>
    <attributes>
      <name>ExpenseType</name>
      <type>
        <types>CatalogRef.ExpenseAndRevenueTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>DeliveryDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Detail</name>
      <type>
        <types>DefinedType.typeDescription</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>SpecialOffers</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Offer</name>
      <type>
        <types>CatalogRef.SpecialOffers</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>Percent</name>
      <type>
        <types>DefinedType.typePercent</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>TaxList</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Tax</name>
      <type>
        <types>CatalogRef.Taxes</types>
      </type>
    </attributes>
    <attributes>
      <name>Analytics</name>
      <type>
        <types>CatalogRef.TaxAnalytics</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxRate</name>
      <type>
        <types>CatalogRef.TaxRates</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>IncludeToTotalAmount</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ManualAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Currencies</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyFrom</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Rate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ReverseRate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ShowReverseRate</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Multiplicity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MovementType</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Documents/Boxing/Boxing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Boxing</name>
  <registerRecords>AccumulationRegister.StockBalance</registerRecords>
  <registerRecords>AccumulationRegister.StockReservation</registerRecords>
  <registerRecords>AccumulationRegister.GoodsInTransitIncoming</registerRecords>
  <registerRecords>AccumulationRegister.GoodsInTransitOutgoing</registerRecords>
  <registerRecords>InformationRegister.BoxContents</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>ItemBox</name>
    <type>
      <types>CatalogRef.Boxes</types>
    </type>
  </attributes>
  <attributes>
    <name>Store</name>
    <type>
      <types>CatalogRef.Stores</types>
    </type>
  </attributes>
  <attributes>
    <name>Receipt</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOff</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ItemList</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Documents/Unboxing/Unboxing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Unboxing</name>
  <registerRecords>AccumulationRegister.StockBalance</registerRecords>
  <registerRecords>AccumulationRegister.StockReservation</registerRecords>
  <registerRecords>AccumulationRegister.GoodsInTransitIncoming</registerRecords>
  <registerRecords>AccumulationRegister.GoodsInTransitOutgoing</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>ItemKeyBox</name>
    <type>
      <types>CatalogRef.ItemKeys</types>
    </type>
  </attributes>
  <attributes>
    <name>Store</name>
    <type>
      <types>CatalogRef.Stores</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOff</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ItemList</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Documents/Bundling/Bundling.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Bundling</name>
  <registerRecords>AccumulationRegister.StockBalance</registerRecords>
  <registerRecords>AccumulationRegister.StockReservation</registerRecords>
  <registerRecords>AccumulationRegister.GoodsInTransitIncoming</registerRecords>
  <registerRecords>AccumulationRegister.GoodsInTransitOutgoing</registerRecords>
  <registerRecords>InformationRegister.BundleContents</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>ItemBundle</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>Unit</name>
    <type>
      <types>CatalogRef.Units</types>
    </type>
  </attributes>
  <attributes>
    <name>Store</name>
    <type>
      <types>CatalogRef.Stores</types>
    </type>
  </attributes>
  <attributes>
    <name>Quantity</name>
    <type>
      <types>DefinedType.typeQuantity</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ItemList</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Catalogs/Units/Units.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Units</name>
  <attributes>
    <name>Item</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BasisUnit</name>
    <type>
      <types>CatalogRef.Units</types>
    </type>
  </attributes>
</mdclass:Catalog>

IRP/src/Documents/GoodsReceipt/Forms/SelectReceiptBasisesForm/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	SelectReceiptBasisMode = Parameters.SelectReceiptBasisMode;
	If Parameters.Property("FilterValues") Then
		FillDocumentsTree(Parameters.FilterValues, Parameters.ExistingRows, Parameters.Ref);
	Else
		Cancel = True;
	EndIf;
	SetConditionalAppearence();
	SetVisibility();
EndProcedure

&AtServer
Procedure SetVisibility()
	Items.FormSelectAll.Visible = Not SelectReceiptBasisMode;
	Items.FormUnselectAll.Visible = Not SelectReceiptBasisMode;
	Items.DocumentsTreeUse.Visible = Not SelectReceiptBasisMode;
EndProcedure

&AtServer
Procedure SetConditionalAppearence()
	ConditionalAppearance.Items.Clear();
	
	AppearenceElement = ConditionalAppearance.Items.Add();
	
	FieldElement = AppearenceElement.Fields.Items.Add();
	FieldElement.Field = New DataCompositionField(Items.DocumentsTreeReceiptBasis.Name);
	FieldElement = AppearenceElement.Fields.Items.Add();
	FieldElement.Field = New DataCompositionField(Items.DocumentsTreeCurrency.Name);
	
	FilterElement = AppearenceElement.Filter.Items.Add(Type("DataCompositionFilterItem"));
	FilterElement.LeftValue = New DataCompositionField("DocumentsTree.ItemKey");
	FilterElement.ComparisonType = DataCompositionComparisonType.Filled;
	
	AppearenceElement.Appearance.SetParameterValue("Text", "");
EndProcedure

&AtServer
Procedure FillDocumentsTree(FilterValues, ExistingRows, Ref)
	ThisObject.DocumentsTree.GetItems().Clear();
	
	QueryTableOrders = New Query(
			"SELECT ALLOWED
			|	Table.Ref AS ReceiptBasis
			|into tmp
			|FROM
			|	Document.PurchaseOrder AS Table
			|WHERE
			|	Table.Company = &Company
			|	AND Table.Partner = &Partner
			|	AND Table.LegalName = &LegalName
			|	AND Table.GoodsReceiptBeforePurchaseInvoice
			|
			|UNION ALL
			|
			|SELECT
			|	Table.Ref
			|FROM
			|	Document.PurchaseInvoice AS Table
			|WHERE
			|	Table.Company = &Company
			|	AND Table.Partner = &Partner
			|	AND Table.LegalName = &LegalName
			|
			|UNION ALL
			|
			|SELECT
			|	Table.Ref
			|FROM
			|	Document.SalesReturn AS Table
			|WHERE
			|	Table.Company = &Company
			|	AND Table.Partner = &Partner
			|	AND Table.LegalName = &LegalName
			|
			|UNION ALL
			|
			|SELECT
			|	Table.Ref
			|FROM
			|	Document.Boxing AS Table
			|WHERE
			|	Table.Company = &Company
			|	AND &Partner = UNDEFINED
			|	AND &LegalName = UNDEFINED
			|
			|UNION ALL
			|
			|SELECT
			|	Table.Ref
			|FROM
			|	Document.Unboxing AS Table
			|WHERE
			|	Table.Company = &Company
			|	AND &Partner = UNDEFINED
			|	AND &LegalName = UNDEFINED
			|
			|UNION ALL
			|
			|SELECT
			|	Table.Ref
			|FROM
			|	Document.Bundling AS Table
			|WHERE
			|	Table.Company = &Company
			|	AND &Partner = UNDEFINED
			|	AND &LegalName = UNDEFINED
			|
			|UNION ALL
			|
			|SELECT
			|	Table.Ref
			|FROM
			|	Document.Unbundling AS Table
			|WHERE
			|	Table.Company = &Company
			|	AND &Partner = UNDEFINED
			|	AND &LegalName = UNDEFINED
			|
			|UNION ALL
			|
			|SELECT
			|	Table.Ref
			|FROM
			|	Document.InventoryTransfer AS Table
			|WHERE
			|	Table.Company = &Company
			|	AND &Partner = UNDEFINED
			|	AND &LegalName = UNDEFINED
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|SELECT ALLOWED
			|	Table.Store AS Store,
			|	Table.ReceiptBasis AS ReceiptBasis,
			|	Table.Currency AS Currency,
			|	Table.ItemKey,
			|	Table.Unit,
			|	SUM(Table.Quantity) AS Quantity,
			|	Table.RowKey
			|FROM
			|	(SELECT
			|		GoodsInTransitIncomingBalance.Store AS Store,
			|		GoodsInTransitIncomingBalance.ReceiptBasis AS ReceiptBasis,
			|		GoodsInTransitIncomingBalance.ReceiptBasis.Currency AS Currency,
			|		GoodsInTransitIncomingBalance.ItemKey,
			|		CASE
			|			WHEN GoodsInTransitIncomingBalance.ItemKey.Unit <> VALUE(Catalog.Units.EmptyRef)
			|				THEN GoodsInTransitIncomingBalance.ItemKey.Unit
			|			ELSE GoodsInTransitIncomingBalance.ItemKey.Item.Unit
			|		END AS Unit,
			|		GoodsInTransitIncomingBalance.QuantityBalance AS Quantity,
			|		GoodsInTransitIncomingBalance.RowKey
			|	FROM
			|		AccumulationRegister.GoodsInTransitIncoming.Balance(, ReceiptBasis IN
			|			(select
			|				ReceiptBasis
			|			from
			|				tmp) AND CASE
			|							WHEN &FilterByItemKey
			|								THEN ItemKey = &ItemKey
			|							ELSE TRUE
			|						END) AS GoodsInTransitIncomingBalance
			|
			|	UNION ALL
			|
			|	SELECT
			|		DocumentRecords.Store AS Store,
			|		DocumentRecords.ReceiptBasis AS ReceiptBasis,
			|		DocumentRecords.ReceiptBasis.Currency AS Currency,
			|		DocumentRecords.ItemKey,
			|		CASE
			|			WHEN DocumentRecords.ItemKey.Unit <> VALUE(Catalog.Units.EmptyRef)
			|				THEN DocumentRecords.ItemKey.Unit
			|			ELSE DocumentRecords.ItemKey.Item.Unit
			|		END AS Unit,
			|		CASE
			|			WHEN DocumentRecords.RecordType = VALUE(AccumulationRecordType.Receipt)
			|				THEN -DocumentRecords.Quantity
			|			ELSE DocumentRecords.Quantity
			|		END AS Quantity,
			|		DocumentRecords.RowKey
			|	FROM
			|		AccumulationRegister.GoodsInTransitIncoming AS DocumentRecords
			|			INNER JOIN tmp AS tmp
			|			ON tmp.ReceiptBasis = DocumentRecords.ReceiptBasis
			|			AND DocumentRecords.Recorder = &Ref
			|			AND (CASE
			|					WHEN &FilterByItemKey
			|						THEN DocumentRecords.ItemKey = &ItemKey
			|					ELSE TRUE
			|				END)) AS Table
			|
			|GROUP BY
			|	Table.Store,
			|	Table.ReceiptBasis,
			|	Table.Currency,
			|	Table.ItemKey,
			|	Table.Unit,
			|	Table.RowKey");
	QueryTableOrders.SetParameter("Company", FilterValues.Company);
	QueryTableOrders.SetParameter("Partner", ?(ValueIsFilled(FilterValues.Partner), FilterValues.Partner, Undefined));
	QueryTableOrders.SetParameter("LegalName", ?(ValueIsFilled(FilterValues.LegalName), FilterValues.LegalName, Undefined));
	QueryTableOrders.SetParameter("Ref", Ref);
	
	ItemKey = Undefined;
	QueryTableOrders.SetParameter("FilterByItemKey", FilterValues.Property("ItemKey", ItemKey));
	QueryTableOrders.SetParameter("ItemKey", ItemKey);
	
	
	QueryTable = QueryTableOrders.Execute().Unload();
	
	Query = New Query();
	Query.TempTablesManager = DocGoodsReceiptServer.PutQueryTableToTempTable(QueryTable);
	Query.Text =
		"SELECT ALLOWED
		|	tmpQueryTable.Store,
		|	tmpQueryTable.ReceiptBasis AS ReceiptBasis,
		|	tmpQueryTable.Currency AS Currency,
		|	tmpQueryTable.ItemKey,
		|	tmpQueryTable.ItemKey.Item AS Item,
		|	tmpQueryTable.Unit AS QuantityUnit,
		|	tmpQueryTable.Quantity,
		|	tmpQueryTable.Key,
		|	tmpQueryTable.RowKey,
		|
		|	MAX(CASE
		|		WHEN NOT DocPurchaseInvoice.SalesOrder IS NULL
		|			THEN DocPurchaseInvoice.SalesOrder
		|		WHEN NOT DocPurchaseOrder.PurchaseBasis IS NULL
		|			THEN CAST(DocPurchaseOrder.PurchaseBasis AS Document.SalesOrder)
		|		ELSE VALUE(Document.SalesOrder.EmptyRef)
		|	END) AS SalesOrder,
		|
		|	MAX(CASE
		|		WHEN NOT DocPurchaseInvoice.Unit IS NULL
		|			THEN DocPurchaseInvoice.Unit
		|		WHEN NOT DocPurchaseOrder.Unit IS NULL
		|			THEN DocPurchaseOrder.Unit
		|		WHEN NOT DocBoxing.Unit IS NULL
		|			THEN DocBoxing.Unit
		|		WHEN NOT DocBundling.Unit IS NULL
		|			THEN DocBundling.Unit
		|		WHEN NOT DocUnboxing.Unit IS NULL
		|			THEN DocUnboxing.Unit
		|		WHEN NOT DocUnbundling.Unit IS NULL
		|			THEN DocUnbundling.Unit
		|		WHEN NOT DocInventoryTransfer.Unit IS NULL
		|			THEN DocInventoryTransfer.Unit
		|		WHEN NOT DocSalesReturn.Unit IS NULL
		|			THEN DocSalesReturn.Unit
		|		ELSE tmpQueryTable.Unit
		|	END) AS Unit
		|FROM
		|	tmpQueryTable AS tmpQueryTable
		|
		|		LEFT JOIN Document.PurchaseInvoice.ItemList AS DocPurchaseInvoice
		|		ON tmpQueryTable.Key = DocPurchaseInvoice.Key
		|		AND tmpQueryTable.ReceiptBasis = DocPurchaseInvoice.Ref
		|
		|		LEFT JOIN Document.PurchaseOrder.ItemList AS DocPurchaseOrder
		|		ON tmpQueryTable.Key = DocPurchaseOrder.Key
		|		AND tmpQueryTable.ReceiptBasis = DocPurchaseOrder.Ref
		|
		|		LEFT JOIN Document.Boxing.ItemList AS DocBoxing
		|		ON tmpQueryTable.Key = DocBoxing.Key
		|		AND tmpQueryTable.ReceiptBasis = DocBoxing.Ref
		|
		|		LEFT JOIN Document.Bundling.ItemList AS DocBundling
		|		ON tmpQueryTable.Key = DocBundling.Key
		|		AND tmpQueryTable.ReceiptBasis = DocBundling.Ref
		|
		|		LEFT JOIN Document.Unboxing.ItemList AS DocUnboxing
		|		ON tmpQueryTable.Key = DocUnboxing.Key
		|		AND tmpQueryTable.ReceiptBasis = DocUnboxing.Ref
		|
		|		LEFT JOIN Document.Unbundling.ItemList AS DocUnbundling
		|		ON tmpQueryTable.Key = DocUnbundling.Key
		|		AND tmpQueryTable.ReceiptBasis = DocUnbundling.Ref
		|
		|		LEFT JOIN Document.InventoryTransfer.ItemList AS DocInventoryTransfer
		|		ON tmpQueryTable.Key = DocInventoryTransfer.Key
		|		AND tmpQueryTable.ReceiptBasis = DocInventoryTransfer.Ref
		|
		|		LEFT JOIN Document.SalesReturn.ItemList AS DocSalesReturn
		|		ON tmpQueryTable.Key = DocSalesReturn.Key
		|		AND tmpQueryTable.ReceiptBasis = DocSalesReturn.Ref
		|
		|GROUP BY
		|	tmpQueryTable.Store,
		|	tmpQueryTable.ReceiptBasis,
		|	tmpQueryTable.Currency,
		|	tmpQueryTable.ItemKey,
		|	tmpQueryTable.ItemKey.Item,
		|	tmpQueryTable.Unit,
		|	tmpQueryTable.Quantity,
		|	tmpQueryTable.Key,
		|	tmpQueryTable.RowKey
		|";
	
	QueryResult = Query.Execute();
	QueryTable = QueryResult.Unload();
	DocumentsServer.RecalculateQuantityInTable(QueryTable, "Unit");
	
	FilterTable = QueryTable.Copy( , "ReceiptBasis, Currency");
	FilterTable.GroupBy("ReceiptBasis, Currency");
	
	CurrencyTable = FilterTable.Copy( , "Currency");
	CurrencyTable.GroupBy("Currency");
	
	For Each Row_Currency In CurrencyTable Do
		
		NewRow_Currency = ThisObject.DocumentsTree.GetItems().Add();
		NewRow_Currency.Currency = Row_Currency.Currency;
		
		For Each Row_Basis In FilterTable.FindRows(New Structure("Currency", Row_Currency.Currency)) Do
			
			NewRow_Basis = NewRow_Currency.GetItems().Add();
			NewRow_Basis.ReceiptBasis = Row_Basis.ReceiptBasis;
			
			BasisItemsArray = QueryTable.FindRows(New Structure("ReceiptBasis", Row_Basis.ReceiptBasis));
			For Each Row_Item In BasisItemsArray Do
				
				// exclude quantity from existing rows
				ExistingQuantity = 0;
				For i = 0 To ExistingRows.UBound() Do
					If i > ExistingRows.UBound() Then
						Break;
					EndIf;
					
					ExistingRow = ExistingRows[i];
					If ExistingRow.Key = Row_Item.Key Then
						UnitFactor = Catalogs.Units.GetUnitFactor(ExistingRow.Unit, Row_Item.Unit);
						ExistingQuantity = Min(ExistingQuantity + ExistingRow.Quantity / UnitFactor, Row_Item.Quantity);
						ExistingRows.Delete(i);
						i = i - 1;
					EndIf;
				EndDo;
				
				If ExistingQuantity < Row_Item.Quantity Then
					NewRow_Item = NewRow_Basis.GetItems().Add();
					FillPropertyValues(NewRow_Item, Row_Item);
					NewRow_Item.Quantity = NewRow_Item.Quantity - ExistingQuantity;
				EndIf;
			EndDo;
			If Not NewRow_Basis.GetItems().Count() Then
				NewRow_Currency.GetItems().Delete(NewRow_Basis);
			EndIf;
		EndDo;
		If Not NewRow_Currency.GetItems().Count() Then
			DocumentsTree.GetItems().Delete(NewRow_Currency);
		EndIf;
	EndDo;
	
EndProcedure

&AtClient
Procedure DocumentsTreeUseOnChange(Item)
	CurrentRow = DocumentsTree.FindByID(Items.DocumentsTree.CurrentRow);
	If CurrentRow = Undefined Then
		Return;
	EndIf;
	
	For Each Row In CurrentRow.GetItems() Do
		Row.Use = CurrentRow.Use;
		For Each Row_ In Row.GetItems() Do
			Row_.Use = CurrentRow.Use;
		EndDo;
	EndDo;
EndProcedure

&AtClient
Procedure DocumentsTreeBeforeAddRow(Item, Cancel, Clone, Parent, IsFolder, Parameter)
	Cancel = True;
EndProcedure

&AtClient
Procedure DocumentsTreeBeforeDeleteRow(Item, Cancel)
	Cancel = True;
EndProcedure

&AtClient
Procedure Command_Ok(Command)
	If SelectReceiptBasisMode Then
		If Items.DocumentsTree.CurrentRow = Undefined Then
			If Not DocumentsTree.GetItems().Count() Then
				Close(Undefined);
			EndIf;
			Return;
		EndIf;
		Row_Item = DocumentsTree.FindByID(Items.DocumentsTree.CurrentRow);
		If Row_Item = Undefined Then
			Close(Undefined);
			Return;
		EndIf;
		If Not ValueIsFilled(Row_Item.ReceiptBasis) Then
			Return;
		EndIf;
		
		Result = New Array();
		RowStructure = New Structure("SalesOrder, ReceiptBasis, Store, Item, ItemKey, Key, Unit, Quantity");
		FillPropertyValues(RowStructure, Row_Item);
		Result.Add(RowStructure);
		Close(Result);
	Else
		Close(GetSelectedData());
	EndIf;
EndProcedure

&AtClient
Procedure DocumentsTreeSelection(Item, RowSelected, Field, StandardProcessing)
	Command_Ok(Undefined);
EndProcedure


&AtServer
Function GetSelectedData()
	Result = New Array();
	
	For Each Row_Currency In ThisObject.DocumentsTree.GetItems() Do
		For Each Row_Order In Row_Currency.GetItems() Do
			For Each Row_Item In Row_Order.GetItems() Do
				If Row_Item.Use Then
					RowStructure = New Structure("SalesOrder, ReceiptBasis, Store, Item, ItemKey, Key, Unit, Quantity");
					FillPropertyValues(RowStructure, Row_Item);
					Result.Add(RowStructure);
				EndIf;
			EndDo;
		EndDo;
	EndDo;
	Return Result;
EndFunction

&AtClient
Procedure Cancel(Command)
	Close();
EndProcedure

&AtClient
Procedure SelectAll(Command)
	SetUseValue(True);
EndProcedure

&AtClient
Procedure UnselectAll(Command)
	SetUseValue(False);
EndProcedure

&AtClient
Procedure SetUseValue(UseValue)
	For Each Row_Currency In DocumentsTree.GetItems() Do
		Row_Currency.Use = UseValue;
		For Each Row_Basis In Row_Currency.GetItems() Do
			Row_Basis.Use = UseValue;
			For Each Row_Item In Row_Basis.GetItems() Do
				Row_Item.Use = UseValue;
			EndDo;
		EndDo;
	EndDo;
EndProcedure
